Revit 2027 API
Pipe.SetSystemType Method
 Updates the associated system type for the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSystemType(
	ElementId systemTypeId
)
Public Sub SetSystemType (
	systemTypeId As ElementId
)
public:
void SetSystemType(
	ElementId^ systemTypeId
)
member SetSystemType :
        systemTypeId : ElementId -> unit
Parameters
systemTypeId ElementId
 The ElementId of the piping system type.
Exceptions
Exception | Condition
ArgumentException |  The systemTypeId is not valid piping system type.
ArgumentNullException |  A non-optional argument was null
Remarks
 If the pipe previously did not have a system associated to it, this will create a new system.
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace